<a href="https://colab.research.google.com/github/noaihere/distillery/blob/master/short_python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np
import re
# test

**Dataframe creation**

In [0]:
df = pd.DataFrame(columns=['a','b','c','1-a1','1-b1'], data = [[10, 20, 32,44,55]])
df

    a   b   c  1-a1  1-b1
0  10  20  32    44    55

**Column names**

Rename column name by name

In [0]:
df.rename(columns = {"a" : "apple"})

   apple   b   c  1-a1  1-b1
0     10  20  32    44    55

Rename column name by position/index

In [0]:
df.columns.values[0] = "apple"
df

   apple   b   c  1-a1  1-b1
0     10  20  32    44    55

Rename index name by name

In [0]:
df = pd.DataFrame(columns=['a','b','c'], data = [[10, 20, 32]], index = ['today'])
print(df, "\n")
df.rename(index = {'today':'0'}, inplace=True)
df

        a   b   c
today  10  20  32

    a   b   c
0  10  20  32

Rename column name by using lambda function

In [0]:
df = pd.DataFrame(columns=['a','b','c','1-a1','1-b1'], data = [[10, 20, 32,44,55]])
df.rename(columns = lambda x : x.replace("-", "("), inplace=True)
print(df)
df.rename(columns = lambda x: re.sub("\d\(\w\d", "special",x), inplace=True)
df

    a   b   c  1(a1  1(b1
0  10  20  32    44    55

    a   b   c  special  special
0  10  20  32       44       55

Re.sub use string that matches () in new string as \\1, \\2

In [0]:
df = pd.DataFrame(columns=['a','b','c','1-a1','1-b1'], data = [[10, 20, 32,44,55]])
df.rename(columns = lambda x: re.sub("\d-(\w\d)","special is \\1",x), inplace=True)
df

    a   b   c  special is a1  special is b1
0  10  20  32             44             55

Rename nan column names by fillna

In [0]:
df = pd.DataFrame(columns=['a', np.nan ,'c','1-a1','1-b1'], data = [[10, 20, 32,44,55]])
print(df,"\n")
print(df.columns.isnull(),"\n")

df.columns = df.columns.fillna("None")
df

    a  NaN   c  1-a1  1-b1
0  10   20  32    44    55

[False  True False False False]

    a  None   c  1-a1  1-b1
0  10    20  32    44    55

Subset dataframe by column names

In [0]:
df = df[[col for col in df.columns if re.search(('-a|-b'), col)]]
df

   1-a1  1-b1
0    44    55

Remove duplicated column names

In [0]:
df = pd.DataFrame(columns=['a', 'a' ,'c','1-a1','1-b1'], data = [[10, 20, 32,44,55]])
print(df.columns.duplicated())

df = df.loc[:, ~df.columns.duplicated()]
df

[False  True False False False]

    a   c  1-a1  1-b1
0  10  32    44    55

**Subset dataframe**

Subset by date time

In [40]:
df = pd.DataFrame({'datetime':['2020-03-20T14:00:00+09:00','2020-03-20T10:00:00+09:00','2020-03-20T18:00:00+09:00',
                           '2020-03-20T20:00:00+09:00']})

df['datetime'] = pd.to_datetime(df['datetime'])
df['date'] = df['datetime'].dt.date
df['time'] = df['datetime'].dt.time

df_subset = df.loc[(df['time']>= datetime.time(hour=11, minute=00)) & (df['time'] <= datetime.time(hour=19, minute=00)), :]

print(df_subset)

                   datetime        date      time
0 2020-03-20 14:00:00+09:00  2020-03-20  14:00:00
2 2020-03-20 18:00:00+09:00  2020-03-20  18:00:00

**Dataframe column values**

Sum 2 columns ignore nan

In [0]:
df = pd.DataFrame({'a':[1.2,34,35], 'b':[342,51,np.nan]})
df['z'] = df['b'].add(df['a'], fill_value=0)
df

      a      b      z
0   1.2  342.0  343.2
1  34.0   51.0   85.0
2  35.0    NaN   35.0

Sum columns using df.sum ignore nan default

In [0]:
df = pd.DataFrame({'a':[1.2,34,35], 'b':[342,51,np.nan]})
df['z'] = df['b'].add(df['a'], fill_value=0)
df[['b','z']].sum(axis=1)

0    685.2
1    136.0
2     35.0
dtype: float64

Use apply and lambda function

In [42]:
from datetime import timedelta
df = pd.DataFrame({'datetime':['2020-03-20T14:00:00+09:00','2020-03-20T10:00:00+09:00','2020-03-20T18:00:00+09:00',
                           '2020-03-20T20:00:00+09:00']})

df['datetime'] = pd.to_datetime(df['datetime'])
df['date'] = df['datetime'].dt.date
df['time'] = df['datetime'].dt.time

print(df)

# minus 1 day from date if time < 15.00
df['date'] = df.apply(lambda row: row['date'] -timedelta(1) if row['time'] <= datetime.time(hour=15,minute=00) else row['date'],axis=1)
df

                   datetime        date      time
0 2020-03-20 14:00:00+09:00  2020-03-20  14:00:00
1 2020-03-20 10:00:00+09:00  2020-03-20  10:00:00
2 2020-03-20 18:00:00+09:00  2020-03-20  18:00:00
3 2020-03-20 20:00:00+09:00  2020-03-20  20:00:00

                   datetime        date      time
0 2020-03-20 14:00:00+09:00  2020-03-19  14:00:00
1 2020-03-20 10:00:00+09:00  2020-03-19  10:00:00
2 2020-03-20 18:00:00+09:00  2020-03-20  18:00:00
3 2020-03-20 20:00:00+09:00  2020-03-20  20:00:00

**Group by aggregation**

In [56]:
df = pd.DataFrame({'date':['2020-02-18','2020-02-18','2020-03-18','2020-03-18','2020-02-18','2020-02-18','2020-03-18','2020-03-18'], 'city': ['tokyo','tokyo','tokyo','tokyo','seoul','seoul','seoul','seoul'],
                    'value':[10,22,11,9,29,39,12,5],'price':[1,2,1,3,9,19,12,5]})

print(df)

# aggregate to daily
df_summary = df.groupby(['date', 'city']).agg(
        {'value': ['min'], 'price': ['max']})

print(df_summary)

# join header names
df_summary.columns = ['_'.join(col).strip() for col in df_summary.columns.values]
print(df_summary)
df_summary = df_summary.reset_index()
df_summary

         date   city  value  price
0  2020-02-18  tokyo     10      1
1  2020-02-18  tokyo     22      2
2  2020-03-18  tokyo     11      1
3  2020-03-18  tokyo      9      3
4  2020-02-18  seoul     29      9
5  2020-02-18  seoul     39     19
6  2020-03-18  seoul     12     12
7  2020-03-18  seoul      5      5
                 value price
                   min   max
date       city
2020-02-18 seoul    29    19
           tokyo    10     2
2020-03-18 seoul     5    12
           tokyo     9     3
                  value_min  price_max
date       city
2020-02-18 seoul         29         19
           tokyo         10          2
2020-03-18 seoul          5         12
           tokyo          9          3

         date   city  value_min  price_max
0  2020-02-18  seoul         29         19
1  2020-02-18  tokyo         10          2
2  2020-03-18  seoul          5         12
3  2020-03-18  tokyo          9          3

**Datetime**

In [0]:
import datetime

Datetime to date and time

In [8]:
dt = pd.to_datetime('2020-03-20T14:00:00+09:00')
date = dt.date()
time = dt.time()

print(date)
print(time)

2020-03-20
14:00:00

compare time

In [10]:
print(datetime.time(hour=13, minute=00))
time > datetime.time(hour=13, minute=00)

13:00:00

True

extract time from +08:00 string

In [13]:
# extract operator and time from +08:00
d="+12:00"
operator = re.search("([+-])(\d{2}:\d{2})",d).group(1)
print(operator)

time = int(float(re.search("([+-])(\d{2}:\d{2})",d).group(2).lstrip("0").replace(":",".")))
print(time)

+
12

calculate time deltas/difference

In [16]:
from datetime import timedelta
print(pd.to_datetime('2020-03-23T08:00:00+00:00') -timedelta(1))
pd.to_datetime('2020-03-23T08:00:00+00:00') -timedelta(hours=2)

2020-03-22 08:00:00+00:00

Timestamp('2020-03-23 06:00:00+0000', tz='UTC')

check is today's date equivalent

In [27]:
df = pd.DataFrame({'date':['2020-03-18','2020-03-19','2020-03-20',
                           '2020-02-19']})

print((pd.DatetimeIndex(df['date']).day))
print(pd.datetime.now().day)

# all means if there is one True, it will be True

if (pd.DatetimeIndex(df['date']).day != pd.datetime.now().day).all():
    print("not current day data")
if (pd.DatetimeIndex(df['date']).month != pd.datetime.now().month).all():
    print("not current month data")
if (pd.DatetimeIndex(df['date']).year != pd.datetime.now().year).all():
    print("not current year data")

Int64Index([18, 19, 20, 19], dtype='int64', name='date')
20